; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	instrument10 - instrument
	image1 - mode
	image2 - mode
	infrared0 - mode
	Star1 - direction
	Star4 - direction
	GroundStation3 - direction
	GroundStation0 - direction
	Star8 - direction
	GroundStation9 - direction
	Star5 - direction
	Star7 - direction
	Star2 - direction
	Star10 - direction
	Star6 - direction
	Phenomenon11 - direction
	Star12 - direction
	Planet13 - direction
	Planet14 - direction
	Phenomenon15 - direction
	Planet16 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 infrared0)
	(calibration_target instrument0 GroundStation3)
	(calibration_target instrument0 Star2)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 infrared0)
	(supports instrument1 image1)
	(supports instrument1 image2)
	(calibration_target instrument1 Star8)
	(calibration_target instrument1 Star6)
	(calibration_target instrument1 Star7)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star12)
	(supports instrument2 image2)
	(calibration_target instrument2 GroundStation0)
	(calibration_target instrument2 Star2)
	(supports instrument3 image2)
	(supports instrument3 image1)
	(supports instrument3 infrared0)
	(calibration_target instrument3 Star8)
	(calibration_target instrument3 Star10)
	(calibration_target instrument3 Star5)
	(supports instrument4 image2)
	(supports instrument4 infrared0)
	(supports instrument4 image1)
	(calibration_target instrument4 GroundStation9)
	(calibration_target instrument4 Star10)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation9)
	(supports instrument5 image2)
	(calibration_target instrument5 Star7)
	(calibration_target instrument5 Star8)
	(calibration_target instrument5 Star2)
	(supports instrument6 image1)
	(supports instrument6 image2)
	(calibration_target instrument6 Star5)
	(calibration_target instrument6 GroundStation9)
	(calibration_target instrument6 Star7)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star2)
	(supports instrument7 image2)
	(calibration_target instrument7 Star6)
	(calibration_target instrument7 Star7)
	(calibration_target instrument7 Star5)
	(supports instrument8 infrared0)
	(supports instrument8 image1)
	(supports instrument8 image2)
	(calibration_target instrument8 Star2)
	(calibration_target instrument8 Star10)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation3)
	(supports instrument9 infrared0)
	(supports instrument9 image2)
	(supports instrument9 image1)
	(calibration_target instrument9 Star10)
	(supports instrument10 infrared0)
	(supports instrument10 image1)
	(calibration_target instrument10 Star6)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star7)
)
(:goal (and
	(have_image Phenomenon11 infrared0)
	(have_image Star12 infrared0)
	(have_image Planet13 image1)
	(have_image Planet14 image2)
	(have_image Phenomenon15 image1)
	(have_image Planet16 image2)
))

)

; plan
1. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 0 of 6
2. (calibrate satellite1 instrument4 groundstation9)
   added: (calibrated instrument4)
   goals met: 0 of 6
3. (turn_to satellite1 planet14 groundstation9)
   deleted: (pointing satellite1 groundstation9)
   added: (pointing satellite1 planet14)
   goals met: 0 of 6
4. (take_image satellite1 planet14 instrument4 image2)
   added: (have_image planet14 image2)
   goals met: 1 of 6
5. (turn_to satellite1 planet13 planet14)
   deleted: (pointing satellite1 planet14)
   added: (pointing satellite1 planet13)
   goals met: 1 of 6
6. (take_image satellite1 planet13 instrument4 image1)
   added: (have_image planet13 image1)
   goals met: 2 of 6
7. (turn_to satellite1 phenomenon15 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 phenomenon15)
   goals met: 2 of 6
8. (take_image satellite1 phenomenon15 instrument4 image1)
   added: (have_image phenomenon15 image1)
   goals met: 3 of 6
9. (turn_to satellite1 phenomenon11 phenomenon15)
   deleted: (pointing satellite1 phenomenon15)
   added: (pointing satellite1 phenomenon11)
   goals met: 3 of 6
10. (take_image satellite1 phenomenon11 instrument4 infrared0)
   added: (have_image phenomenon11 infrared0)
   goals met: 4 of 6
11. (turn_to satellite1 planet16 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 planet16)
   goals met: 4 of 6
12. (take_image satellite1 planet16 instrument4 image2)
   added: (have_image planet16 image2)
   goals met: 5 of 6
13. (turn_to satellite1 star12 planet16)
   deleted: (pointing satellite1 planet16)
   added: (pointing satellite1 star12)
   goals met: 5 of 6
14. (take_image satellite1 star12 instrument4 infrared0)
   added: (have_image star12 infrared0)
   goals met: 6 of 6
